# (1) Дано масив чисел, знайти суму всіх додатніх чисел  масиву не використовуючи цикли:

arr = [4, 0, -5, -1, 7, -1, 3]
sum = 0
arr.each{|k| sum += k if k > 0}
print(sum)

#########################################################################################

# (2) Задано масив, створити новий масив із даних цього масиву які є рядком.

arr = ["apple", true, "kiwi", 4, 88, "33", false, "undefined", "JS"]
newArr = arr.select{ |el| el.is_a?(String) }
puts newArr.inspect

#########################################################################################

# (3) Задано масив чисел, знайти число яке найбільш часто входить в масив, занести це число в новий масив і видалити всі входження цього числа із поточного масиву.

arr = [4, 5, 2, 1, 6, 5, 3, 5, 2, 5]
f = Hash.new(0)
arr.each { |n| f[n] += 1 }
number = arr.max_by { |n| f[n] }
newArr = [number]
arr.delete_if { |n| n == number }
print(arr.inspect)

####################################################################################################################################################################

# (4) Знайти в масиві двозначні(10+), трьохзначні(100+) та чотирьохзначні(1000+)  числа та повертає в масив їх кількість.

arr = [1,2,55,3,100, 333, 9999]
count = [0, 0, 0]
arr.each do |n|
    if n >= 10 && n < 100
        count[0] += 1
    elsif n >= 100 && n < 1000
        count[1] += 1
    elsif n >= 1000
        count[2] += 1
    end
end
puts count.inspect

#########################################################################################################################

# (5) Є масив [5, “Limit”, 12, “a”, “3”, 99, 2, [2, 4, 3, “33”, “a”, “text”], “strong”, “broun”] Вивести нові масиви яка складаються із даних початкового масиву, але одного типу даних (не приводити тип стрінг в число навіть якщо там лише число)

arr = [5, "Limit", 12,"a", "3", 99, 2, [2, 4, 3, "33", "a", "text"], "strong", "broun"]
arr.flatten!
numbers = []
strings = []
for i in arr
    if i.class == Integer
        numbers.push(i)
    else i.class == String
        strings.push(i)
    end
end
print(numbers, "\n")
print(strings)

####################################################################################################################################################################################################################################################

# (6) Дано рядок із іменами, перетворити їх в масив, в масиві повидаляти лишні пробели, посортувати значення і вивести в новий масив імена які більше 4 символів мають, а в старий масив вивести відсортовані значення і об'єднати їх в рядок

names = "Alex,    Orysia, Misha,    Ira     , Paul"
names_array = names.split(",").map(&:strip)
sorted_names = names_array.sort.join(", ")
puts sorted_names

#############################################################################################################################################################################################################################################