# (1) спробувати зробити конкатенацію масиву всередині інтерполяції

array1 = [1, 2, 3, 4]
array2 = [5, 6, 7, 8, 9]
print("Array is: #{array1+array2}")

####################################################################

# (2) є рядок із текстом, потрібно визначити кількість входжень літери "а" в рядку.

str = "In my country we put our name first when we write it or when we say it, but in some official documents we have our names written at the end and the last-name first."
c = str.count('a')
print(c)

###################################################################################

# (3) із тексту наведеного вище, створити масив із слів, які повторюються

array = str.split
print(array.select{|i| array.count(i) > 1 }.uniq)

##########################################################################

# (4) зробити кожне слово в тексті щоб починалось із великої літери

capt = str.split.map(&:capitalize).join(' ')
print(capt)

###################################################################

# (5) зробити із наведеного тексту масив, через розділювач кому.

coma = str.split(",")
print(coma)

################################################################

# (6) перетворити масив в текст, і щоб на місці де була кома стояла трикрамка(...)

s = str.split(",")
s = s.join("...")
print(s)

##################################################################################

# (7) згенерувати масив із 10 елементів, і засетити туда сьогоднішню дату.

data = Array.new(10)
data[0] = Time.new.strftime('%d-%m-%y')
print(data[0])

##########################################################################

# (8) використати метод uniq для згенерованого масиву, після чого викликати масив(чи зміниться значення масиву?) 

array = Array.new(10) { rand(10) }
print(array)
puts
array.uniq
print(array)

# (8) Відповідь: масив не змінився

#################################################################################################################